ContryInfoConfigs/src/main/synapse-config/sequences/LanguageSequences.xml

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="LanguageSequences" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
    <payloadFactory media-type="xml">
        <format>
            <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
                <soapenv:Header/>
                <soapenv:Body>
                    <web:LanguageISOCode>
                        <web:sLanguageName>$1</web:sLanguageName>
                    </web:LanguageISOCode>
                </soapenv:Body>
            </soapenv:Envelope>
        </format>
        <args>
            <arg evaluator="xml" expression="$ctx:iso"/>
        </args>
    </payloadFactory>
    <call>
        <endpoint key="ContryInfoEndpoints"/>
    </call>
    <log level="full"/>
</sequence>
